use super::{RuneSet, rune_set, first};

pub fn rune_set() -> RuneSet {
    rune_set!{
        'ᚠ' => 'f';
        'ᚢ' => 'u', 'ú';
        'ᚦ' => 'þ', 'ð';
        'ᚨ' => 'a', 'á';
        'ᚱ' => 'r';
        'ᚲ' => 'k', 'c';
        'ᚷ' => 'g';
        'ᚹ' => 'w';
        'ᚺ', 'ᚻ' => 'h';
        'ᚾ' => 'n';
        'ᛁ' => 'i', 'í';
        'ᛃ' => 'j';
        'ᛇ' => 'ï', 'æ', 'ǽ';
        'ᛈ' => 'p';
        'ᛉ' => 'z';
        'ᛊ', 'ᛋ' => 's';
        'ᛏ' => 't';
        'ᛒ' => 'b';
        'ᛖ' => 'e', 'é';
        'ᛗ' => 'm';
        'ᛚ' => 'l';
        'ᛜ', 'ᛝ' => 'ŋ';
        'ᛟ' => 'o', 'ó';
        'ᛞ' => 'd';
    }
}
