use super::{RuneSet, rune_set, first};

pub fn rune_set() -> RuneSet {
    rune_set!{
        'ᛁ' => 'i', 'í', 'j';
        'ᛂ' => 'é';
        // unstressed i
        'ᛅ' => 'e', 'ę', 'æ', 'ǽ';
        'ᚤ', 'ᛦ' => 'y', 'ý';
        'ᚯ' => 'ø', 'ǿ';
        'ᚢ' => 'u', 'ú';
        // unstressed o
        'ᚮ' => 'o', 'ó';
        'ᛆ' => 'a', 'á', 'ǫ', 'ą', 'å';

        // consonant boys
        'ᛔ' => 'p';
        'ᛒ' => 'b';
        'ᚠ' => 'f';
        'ᚡ' => 'v';
        'ᛐ' => 't';
        'ᛑ' => 'd';
        'ᚦ' => 'þ';
        'ᚧ' => 'ð';
        'ᛌ' => 's', 'z';
        'ᚴ' => 'k', 'c';
        'ᚵ' => 'g';
        'ᚼ' => 'h';
        'ᛘ' => 'm';
        'ᚿ' => 'n';
        'ᚱ' => 'r';
        'ᛧ' => 'ʀ', 'R';
        'ᛚ' => 'l';
    }
}
